Description: Upload Apidog PKG to JAMF
Identifier: com.github.jonmacguru.jamf.apidog
Input:
  NAME: Apidog
ParentRecipe: com.github.jonmacguru.pkg.apidog
MinimumVersion: "2.3"
Process:
  - Processor: JamfUploader
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/Apidog.pkg"
      category: "Engineering"
      policy_name: "Install Apidog"
      upload: true
