<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Upload the Apidog PKG to Jamf Pro.</string>
  <key>Identifier</key>
  <string>com.github.jonmacguru.jamf-upload.apidog</string>
  <key>ParentRecipe</key>
  <string>com.github.jonmacguru.pkg.apidog</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>JamfUploader</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/Apidog.pkg</string>
        <!-- Add Jamf Pro credentials and server URL here -->
      </dict>
    </dict>
  </array>
</dict>
</plist>
