<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Mounts DMG and packages Apidog app as PKG.</string>
  <key>Identifier</key>
  <string>com.github.jonmacguru.pkg.apidog</string>
  <key>ParentRecipe</key>
  <string>com.github.jonmacguru.download.apidog</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>AppPkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/Apidog.dmg</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
