Description: Download Apidog ZIP for macOS
Identifier: com.github.jonmacguru.download.apidog
Input:
  NAME: Apidog
  DOWNLOAD_URL: https://file-assets.apidog.com/download/Apidog-macOS-arm64-latest.zip
MinimumVersion: "2.3"
Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: Apidog.zip
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
