Description: Build PKG from Apidog DMG
Identifier: com.github.jonmacguru.pkg.apidog
Input:
  NAME: Apidog
ParentRecipe: com.github.jonmacguru.download.apidog
MinimumVersion: "2.3"
Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/Apidog.zip"
      destination_path: "%RECIPE_CACHE_DIR%/downloads/"
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/downloads/Apidog.dmg"
      pkg_path: "%RECIPE_CACHE_DIR%/Apidog.pkg"
