<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by hand using another PKG recipe</string>
	<key>Description</key>
	<string>Downloads the latest version of Apidog and creates a package.</string>
	<key>Identifier</key>
	<string>jonmacguru-recipes.pkg.Apidog</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Apidog</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>jonmacguru-recipes.download.Apidog</string>
	<key>Process</key>
	<array>
		<dict>
      		<key>Processor</key>
      		<string>AppPkgCreator</string>
      		<key>Arguments</key>
      		<dict>
        		<key>app_path</key>
        		<string>%pathname%/Apidog.app</string>
        		<key>pkg_name</key>
        		<string>Apidog</string>
      		</dict>
    	</dict>
	</array>
</dict>
</plist>
