<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Download and unzip Apidog zip file.</string>
  <key>Identifier</key>
  <string>com.github.jonmacguru.download.apidog</string>
  <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Apidog</string>
	</dict>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://file-assets.apidog.com/download/Apidog-macOS-arm64-latest.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key>
        <string>%pathname%</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
